//SBGOLOBD  JOB (ACCT#),S-GOLOB,
// NOTIFY=&SYSUID,
// CLASS=B,MSGCLASS=X
//*
//*   EXAMINE THE CONTENTS OF A GROUP OF DASD PACKS
//*   CHOSEN BY VOLSER PREFIX (FOR EXAMPLE 'DATA' FOR
//*   PACKS WITH VOLSER=DATA**).  REPORT SHOWS THE
//*   NUMBER OF DATASETS ON THESE PACKS, WITH A GIVEN
//*   DATASET PREFIX.
//*
//*   FOR EXAMPLE, IF YOU WANT TO SEE THE SPECTRUM OF
//*   ALL THE DATASETS YOU HAVA ON YOUR WORK PACKS, YOU
//*   MIGHT CODE PARM='WORK' OR PARM='WRK', DEPENDING ON
//*   WHAT YOUR WORK PACKS ARE CALLED.
//*
//REPORT  EXEC PGM=DASDSUM,PARM='WORK'     <-- VOLSER PREFIX
//STEPLIB  DD  DISP=SHR,DSN=SYS1.CBT.LINKLIB
//SYSPRINT DD  SYSOUT=*
