//SBGOLOBI  JOB (ACCT#),S-GOLOB,
// NOTIFY=&SYSUID,
// CLASS=B,MSGCLASS=X
//*
//COPYIMG  EXEC PGM=ICOPY
//STEPLIB  DD  DISP=SHR,DSN=SYS1.CBT.LINKLIB
//SYSPRINT DD  SYSOUT=*
//INPUT    DD  DISP=SHR,DSN=SBGOLOB.B.ASM
//OUTPUT  DD  DSN=SBGOLOB.B.ASM.RESTORE,DISP=(NEW,CATLG,DELETE),
//        UNIT=3390,
//        VOL=SER=WORKS4,
//        SPACE=(TRK,(12000,1200)) <-YOU DON'T NEED THE DIRECTORY INFO,
//*                                <-JUST THE DATASET SIZE.
